Repository: team-unstablers/NoctilucaServer
Catalog: NoctilucaClient/NoctilucaClient/resources/Localizable.xcstrings
Source language: ko
Languages: en, ja, zh_hans

# error.closure.internal_server_error
source: 호스트 내부 오류로 인해 연결이 종료되었습니다.
en: Connection closed due to a host internal error.
ja: ホストの内部エラーにより、接続が終了しました。
zh_hans: 由于主机内部错误，连接已结束。

# error.closure.protocol_error
source: 프로토콜 오류로 인해 호스트가 연결을 종료했습니다.
en: The host closed the connection due to a protocol error.
ja: プロトコルエラーのため、ホストが接続を終了しました。
zh_hans: 由于协议错误，主机结束了连接。

# error.closure.session_allocation_failed
source: 서버의 세션 할당 실패로 인해 연결이 종료되었습니다.
en: Connection closed due to the server's failure to allocate a session.
ja: サーバーのセッション割り当てに失敗したため、接続が終了しました。
zh_hans: 由于服务器会话分配失败，连接已结束。

# error.closure.successful
source: 호스트가 세션을 종료했습니다.
en: The host closed the session.
ja: ホストがセッションを終了しました。
zh_hans: 主机已结束会话。

# error.closure.unknown_code
source: 호스트가 연결을 종료했습니다. (코드: %@)
en: The host closed the connection. (Code: %@)
ja: ホストが接続を終了しました。(コード: %@)
zh_hans: 主机已结束连接。(代码：%@)

# error.connection_failed
source: 연결에 실패했습니다. %@
en: Failed to connect. %@
ja: 接続に失敗しました。 %@
zh_hans: 连接失败。 %@

# error.invalid_phase
source: 잘못된 페이즈 전환이 시도되었습니다.
en: An invalid phase transition was attempted.
ja: 無効なフェーズ切り替えが試みられました。
zh_hans: 尝试了无效的阶段转换。

# error.protocol_version_mismatch
source: 프로토콜 버전이 호환되지 않습니다. Client: %1$@, Server: %2$@
en: Protocol version is incompatible. Client: %1$@, Server: %2$@
ja: プロトコルバージョンが互換性がありません。 Client: %1$@, Server: %2$@
zh_hans: 协议版本不兼容。 客户端：%1$@，服务器：%2$@

# error.remote_closed_connection
source: 연결이 예기치 않게 끊어졌습니다.
en: The connection was unexpectedly closed.
ja: 接続が予期せず切断されました。
zh_hans: 连接意外断开。

# error.unsupported_protocol_version
source: 지원하지 않는 프로토콜 버전입니다.
en: Unsupported protocol version.
ja: サポートされていないプロトコルバージョンです。
zh_hans: 不支持的协议版本。

# floating_palette.software_keyboard_toggle
source: 소프트웨어 키보드 토글
en: Toggle Software Keyboard
ja: ソフトウェアキーボード切り替え
zh_hans: 切换软件键盘

# floating_palette.zoom_mode.cursor_tracking
source: 커서 추적 줌
en: Cursor Tracking Zoom
ja: カーソル追従ズーム
zh_hans: 光标跟随缩放

# floating_palette.zoom_mode.free
source: 프리 줌
en: Free Zoom
ja: フリーズーム
zh_hans: 自由缩放

# main.address_bar.candidate.connect_format
source: 설정 검토 후 %@ 으로 연결하기
en: Review settings and connect to %@
ja: 設定を確認後 %@ に接続
zh_hans: 检查设置后连接到 %@

# main.address_bar.candidate.quick_connect_format
source: 기본 설정을 사용하여 %@ 으로 빠르게 연결하기
en: Quick connect to %@ using default settings
ja: 基本設定を使用して %@ にすばやく接続
zh_hans: 使用默认设置快速连接到 %@

# main.address_bar.candidate.registered_contact
source: — 연락처에 등록된 컴퓨터
en: — Registered Computers
ja: — 連絡先に登録されたコンピューター
zh_hans: — 联系人中已注册的计算机

# main.address_bar.degradation.adjustment_prefix
source: 조정 사항:
en: Adjustments:
ja: 調整事項:
zh_hans: 调整：

# main.address_bar.degradation.adjustment.bitrate
source: 비트레이트 낮춤
en: Lower Bitrate
ja: ビットレート低下
zh_hans: 降低码率

# main.address_bar.degradation.adjustment.encoding_efficiency
source: 인코딩 효율 우선 모드
en: Encoding Efficiency First
ja: エンコード効率優先モード
zh_hans: 编码效率优先模式

# main.address_bar.degradation.adjustment.framerate
source: 프레임레이트 낮춤
en: Lower Framerate
ja: フレームレート低下
zh_hans: 降低帧率

# main.address_bar.degradation.adjustment.resolution
source: 해상도 낮춤
en: Lower Resolution
ja: 解像度低下
zh_hans: 降低分辨率

# main.address_bar.degradation.hw_encoder_unavailable
source: 서버가 하드웨어 인코더를 사용할 수 없는 상태입니다. 소프트웨어 인코딩으로 인해 성능이 저하될 수 있습니다.
en: The server cannot use the hardware encoder. Performance may be degraded due to software encoding.
ja: サーバーがハードウェアエンコーダーを使用できない状態です。 ソフトウェアエンコーディングによりパフォーマンスが低下する可能性があります。
zh_hans: 服务器处于无法使用硬件编码器的状态。 使用软件编码可能会导致性能下降。

# main.address_bar.degradation.reason.decoding
source: 디코딩 성능이 부족합니다.
en: Decoding performance is insufficient.
ja: デコード性能が不足しています。
zh_hans: 解码性能不足。

# main.address_bar.degradation.reason.encoding
source: 서버의 인코딩 성능이 부족합니다.
en: Server encoding performance is insufficient.
ja: サーバーのエンコード性能が不足しています。
zh_hans: 服务器编码性能不足。

# main.address_bar.degradation.reason.network
source: 네트워크 대역폭이 부족합니다.
en: Insufficient network bandwidth.
ja: ネットワーク帯域幅が不足しています。
zh_hans: 网络带宽不足。

# main.address_bar.degradation.reason.unknown
source: 알 수 없는 이유로 화면 품질이 조정되었습니다.
en: Screen quality adjusted for unknown reasons.
ja: 不明な理由で画質が調整されました。
zh_hans: 由于未知原因调整了画面质量。

# main.address_bar.degradation.title
source: 화면 품질이 저하되었습니다
en: Screen Quality Degraded
ja: 画質が低下しました
zh_hans: 画面质量已降低

# main.address_bar.placeholder
source: 호스트 주소를 입력하세요
en: Enter Host Address
ja: ホストアドレスを入力してください
zh_hans: 请输入主机地址

# main.address_bar.security.dangerous.description
source: 이 호스트는 macOS의 트러스트 스토어에서 신뢰가 거부된 인증서를 사용하고 있습니다. 원격 제어 세션의 내용을 제 3자가 도청하거나 변조할 위험이 있습니다.
en: This host is using a certificate that is not trusted by the macOS trust store. There is a risk that a third party could eavesdrop on or tamper with the remote control session.
ja: このホストはmacOSのトラストストアで信頼が拒否された証明書を使用しています。 遠隔制御セッションの内容を第三者が盗聴したり改ざんする危険があります。
zh_hans: 此主机使用的证书被 macOS 信任存储库拒绝信任。 存在第三方窃听或篡改远程控制会话内容的风险。

# main.address_bar.security.dangerous.title
source: 안전하지 않은 연결
en: Insecure Connection
ja: 安全でない接続
zh_hans: 不安全的连接

# main.address_bar.security.icon_hint
source: 이 아이콘을 누르면 서버의 인증서 정보를 확인할 수 있습니다.
en: Click this icon to view server certificate information.
ja: このアイコンを押すとサーバーの証明書情報を確認できます。
zh_hans: 点击此图标可查看服务器的证书信息。

# main.address_bar.security.neutral.description
source: 이 호스트는 자가 서명 인증서를 사용하여 암호화된 연결을 제공하고 있습니다.
en: This host provides an encrypted connection using a self-signed certificate.
ja: このホストは自己署名証明書を使用して暗号化された接続を提供しています。
zh_hans: 此主机使用自签名证书提供加密连接。

# main.address_bar.security.neutral.title
source: 암호화된 연결
en: Encrypted Connection
ja: 暗号化された接続
zh_hans: 加密连接

# main.address_bar.security.trustable.description
source: 이 호스트는 macOS의 트러스트 스토어에서 신뢰하는 인증서를 사용하여 암호화 연결을 제공하고 있습니다.
en: This host provides an encrypted connection using a certificate trusted by the macOS trust store.
ja: このホストはmacOSのトラストストアで信頼する証明書を使用して暗号化接続を提供しています。
zh_hans: 此主机使用 macOS 信任存储库信任的证书提供加密连接。

# main.address_bar.security.trustable.title
source: 안전한 연결
en: Secure Connection
ja: 安全な接続
zh_hans: 安全连接

# main.connecting.message_format
source: %@에 연결하고 있습니다...
en: Connecting to %@...
ja: %@ に接続しています...
zh_hans: 正在连接到 %@...

# main.connecting.title
source: 연결 중
en: Connecting
ja: 接続中
zh_hans: 连接中

# main.display_switcher.open_in_new_window
source: 별도 창으로 열기
en: Open in New Window
ja: 別のウィンドウで開く
zh_hans: 在新窗口中打开

# main.display_switcher.title
source: 디스플레이 전환
en: Switch Display
ja: ディスプレイ切り替え
zh_hans: 切换显示器

# main.display_switcher.unnamed
source: (이름 없음)
en: (Unnamed)
ja: (名前なし)
zh_hans: (无名称)

# main.error.title
source: 오류 발생
en: Error
ja: エラー発生
zh_hans: 发生错误

# main.error.unknown
source: 알 수 없는 오류가 발생했습니다.
en: An unknown error occurred.
ja: 不明なエラーが発生しました。
zh_hans: 发生未知错误。

# main.input.keyboard.cjk_hint
source: 스페이스 바 / ↩︎ 키로 확정 — CJK Composition Preview
en: Confirm with Space / ↩︎ — CJK Composition Preview
ja: スペースバー / ↩︎ キーで確定 — CJK Composition Preview
zh_hans: 空格键 / ↩︎ 键确认 — CJK Composition Preview

# main.loopback_warning.message
source: 자기 자신에게 접속하려고 하고 있습니다. 다음과 같은 위험이 있으니 권장하지 않습니다. - 오디오 프로젝션이 활성화된 경우, 듣기 괴로울 정도의 굉음이 발생할 수 있습니다. - 키보드 입력이 무한히 반사되어 원치 않는 조작이 수행될 수 있습니다. 계속 진행하시겠습니까?
en: You are trying to connect to yourself. This is not recommended due to the following risks: - If audio projection is enabled, extremely loud feedback noise may occur. - Keyboard input may be reflected infinitely, causing unintended actions. Do you want to continue?
ja: 自分自身に接続しようとしています。次のような危険があるため推奨しません。 - オーディオプロジェクションが有効な場合、耳障りなほどの轟音が発生する可能性があります。 - キーボード入力が無限に反射され、望ましくない操作が実行される可能性があります。 続行しますか？
zh_hans: 您正试图连接到自己。由于存在以下风险，不建议这样做。 - 如果启用了音频投影，可能会产生刺耳的噪音。 - 键盘输入可能会无限反射，导致执行意外操作。 是否继续？

# main.loopback_warning.title
source: 루프백 경고
en: Loopback Warning
ja: ループバック警告
zh_hans: 回环警告

# main.new_connection.delete_confirm_format
source: '%@'을(를) 삭제하시겠습니까?
en: Are you sure you want to delete '%@'?
ja: '%@'を削除しますか？
zh_hans: 确定要删除 '%@' 吗？

# main.new_connection.delete_host_title
source: 호스트 삭제
en: Delete Host
ja: ホスト削除
zh_hans: 删除主机

# main.new_connection.duplicate_name_format
source: %@ (복사본)
en: %@ (Copy)
ja: %@ (コピー)
zh_hans: %@ (副本)

# main.new_connection.load_error
source: 연락처 목록을 불러오지 못했습니다.
en: Failed to load contact list.
ja: 連絡先リストを読み込めませんでした。
zh_hans: 无法加载联系人列表。

# main.new_connection.no_saved_hosts
source: 저장된 호스트가 없습니다
en: No saved hosts
ja: 保存されたホストがありません
zh_hans: 没有保存的主机

# main.new_connection.no_saved_hosts_hint
source: 아래 버튼을 눌러 새 호스트를 추가하거나, 상단 주소창에서 바로 연결하세요.
en: Click the button below to add a new host, or connect directly from the address bar above.
ja: 下のボタンを押して新しいホストを追加するか、 上部のアドレスバーから直接接続してください。
zh_hans: 请点击下方按钮添加新主机， 或在上方地址栏直接连接。

# main.new_connection.saved_hosts
source: 저장된 호스트
en: Saved Hosts
ja: 保存されたホスト
zh_hans: 已保存的主机

# main.new_connection.version_format
source: 버전 %@
en: Version %@
ja: バージョン %@
zh_hans: 版本 %@

# main.server_address
source: 서버 주소
en: Server Address
ja: サーバーアドレス
zh_hans: 服务器地址

# mainwindow.content.initializing-projection-channel
source: 프로젝션 채널 초기화 중...
en: Initializing projection channel...
ja: プロジェクションチャンネルを初期化中...
zh_hans: 正在初始化投影通道...

# mainwindow.content.preparing-session
source: 세션 준비 중...
en: Preparing session...
ja: セッションを準備中...
zh_hans: 正在准备会话...

# mainwindow.remote-session.loading-display-layout
source: 디스플레이 구성을 로드하고 있습니다
en: Loading display configuration...
ja: ディスプレイ構成を読み込んでいます...
zh_hans: 正在加载显示配置...

# menu.about
source: Noctiluca Navigator에 대하여
en: About Noctiluca Navigator
ja: Noctiluca Navigatorについて
zh_hans: 关于 Noctiluca Navigator

# menu.app_help
source: Noctiluca Navigator 도움말
en: Noctiluca Navigator Help
ja: Noctiluca Navigator ヘルプ
zh_hans: Noctiluca Navigator 帮助

# menu.bring_all_to_front
source: 모두 앞으로 가져오기
en: Bring All to Front
ja: すべて手前に移動
zh_hans: 全部前置

# menu.check_for_updates
source: 업데이트 확인…
en: Check for Updates…
ja: アップデートを確認…
zh_hans: 检查更新…

# menu.close_window
source: 윈도우 닫기
en: Close Window
ja: ウィンドウを閉じる
zh_hans: 关闭窗口

# menu.copy
source: 복사하기
en: Copy
ja: コピー
zh_hans: 拷贝

# menu.cut
source: 잘라내기
en: Cut
ja: 切り取り
zh_hans: 剪切

# menu.delete
source: 삭제
en: Delete
ja: 削除
zh_hans: 删除

# menu.edit
source: 편집
en: Edit
ja: 編集
zh_hans: 编辑

# menu.enter_full_screen
source: 전체 화면 시작
en: Enter Full Screen
ja: フルスクリーンにする
zh_hans: 进入全屏幕

# menu.file
source: 파일
en: File
ja: ファイル
zh_hans: 文件

# menu.help
source: 도움말
en: Help
ja: ヘルプ
zh_hans: 帮助

# menu.hide_app
source: Noctiluca Navigator 가리기
en: Hide Noctiluca Navigator
ja: Noctiluca Navigatorを隠す
zh_hans: 隐藏 Noctiluca Navigator

# menu.hide_others
source: 기타 가리기
en: Hide Others
ja: その他を隠す
zh_hans: 隐藏其他

# menu.minimize
source: 최소화
en: Minimize
ja: 最小化
zh_hans: 最小化

# menu.new_window
source: 새 윈도우
en: New Window
ja: 新規ウィンドウ
zh_hans: 新建窗口

# menu.paste
source: 붙여넣기
en: Paste
ja: 貼り付け
zh_hans: 粘贴

# menu.quit_app
source: Noctiluca Navigator 종료
en: Quit Noctiluca Navigator
ja: Noctiluca Navigatorを終了
zh_hans: 退出 Noctiluca Navigator

# menu.redo
source: 다시 실행
en: Redo
ja: やり直し
zh_hans: 重做

# menu.select_all
source: 전체 선택
en: Select All
ja: すべて選択
zh_hans: 全选

# menu.services
source: 서비스
en: Services
ja: サービス
zh_hans: 服务

# menu.settings
source: Noctiluca Navigator 설정…
en: Noctiluca Navigator Settings…
ja: Noctiluca Navigator 設定…
zh_hans: Noctiluca Navigator 设置…

# menu.show_all
source: 모두 보기
en: Show All
ja: すべて表示
zh_hans: 全部显示

# menu.undo
source: 실행 취소
en: Undo
ja: 元に戻す
zh_hans: 撤销

# menu.view
source: 보기
en: View
ja: 表示
zh_hans: 查看

# menu.window
source: 윈도우
en: Window
ja: ウィンドウ
zh_hans: 窗口

# menu.zoom
source: 확대/축소
en: Zoom
ja: 拡大/縮小
zh_hans: 缩放

# notification.background_session_active.title
source: 백그라운드 재생 중
en: Playing in Background
ja: バックグラウンド再生中
zh_hans: 后台播放中

# quality.desc.bad
source: 서버와의 연결 품질이 낮습니다. 원격 제어 세션이 다소 원활하지 않을 수 있습니다.
en: Server connection quality is low. The remote control session may be somewhat unstable.
ja: サーバーとの接続品質が低いです。遠隔制御セッションがややスムーズでない可能性があります。
zh_hans: 与服务器的连接质量较低。远程控制会话可能有些不流畅。

# quality.desc.excellent
source: 서버와의 연결 품질이 우수합니다.
en: Server connection quality is excellent.
ja: サーバーとの接続品質が優れています。
zh_hans: 与服务器的连接质量优秀。

# quality.desc.good
source: 서버와의 연결 품질이 양호합니다.
en: Server connection quality is good.
ja: サーバーとの接続品質が良好です。
zh_hans: 与服务器的连接质量良好。

# quality.desc.poor
source: 서버와의 연결 품질이 매우 낮습니다. 원격 제어 세션이 원활하지 않을 수 있습니다.
en: Server connection quality is very low. The remote control session may be unstable.
ja: サーバーとの接続品質が非常に低いです。遠隔制御セッションがスムーズでない可能性があります。
zh_hans: 与服务器的连接质量非常低。远程控制会话可能不流畅。

# quality.desc.unknown
source: 서버와의 연결 품질을 알 수 없습니다.
en: Server connection quality is unknown.
ja: サーバーとの接続品質が不明です。
zh_hans: 与服务器的连接质量未知。

# quality.title.bad
source: 낮은 연결 품질
en: Low Connection Quality
ja: 低い接続品質
zh_hans: 连接质量较低

# quality.title.excellent
source: 우수한 연결 품질
en: Excellent Connection Quality
ja: 優れた接続品質
zh_hans: 优秀的连接质量

# quality.title.good
source: 양호한 연결 품질
en: Good Connection Quality
ja: 良好な接続品質
zh_hans: 良好的连接质量

# quality.title.poor
source: 매우 낮은 연결 품질
en: Very Low Connection Quality
ja: 非常に低い接続品質
zh_hans: 极低的连接质量

# quality.title.unknown
source: 연결 품질 알 수 없음
en: Unknown Connection Quality
ja: 接続品質不明
zh_hans: 连接质量未知

# session-settings.delete_contact.message
source: 이 연락처를 삭제하면 복구할 수 없습니다.
en: Deleting this contact cannot be undone.
ja: この連絡先を削除すると復元できません。
zh_hans: 删除此联系人后无法恢复。

# session-settings.delete_contact.title
source: 연락처 삭제
en: Delete Contact
ja: 連絡先削除
zh_hans: 删除联系人

# session-settings.general.endpoint
source: 호스트 주소
en: Host Address
ja: ホストアドレス
zh_hans: 主机地址

# session-settings.general.endpoint.example
source: 예: office.example.com:8282
en: e.g., office.example.com:8282
ja: 例: office.example.com:8282
zh_hans: 例如：office.example.com:8282

# session-settings.general.endpoint.placeholder
source: 호스트 주소 (host:port)
en: Host Address (host:port)
ja: ホストアドレス (host:port)
zh_hans: 主机地址 (host:port)

# session-settings.general.icon
source: 아이콘
en: Icon
ja: アイコン
zh_hans: 图标

# session-settings.general.icon.background
source: 배경색
en: Background Color
ja: 背景色
zh_hans: 背景色

# session-settings.general.icon.symbol
source: 심볼
en: Symbol
ja: シンボル
zh_hans: 符号

# session-settings.general.name
source: 이름
en: Name
ja: 名前
zh_hans: 名称

# session-settings.general.name.placeholder
source: 연락처 이름
en: Contact Name
ja: 連絡先名
zh_hans: 联系人名称

# session-settings.input.experimental
source: 실험 기능
en: Experimental
ja: 実験機能
zh_hans: 实验性功能

# session-settings.input.hack.hangul_toggle
source: 한국어: Windows 스타일의 한/영 전환
en: Korean: Windows-style Han/Eng Toggle
ja: 韓国語: Windowsスタイルの日/英(韓/英)切り替え
zh_hans: 韩语：Windows 风格的中/英切换

# session-settings.input.hack.hangul_toggle_desc
source: Windows 스타일의 한/영 전환 동작을 에뮬레이트합니다. 오른쪽 ⌘ (Command)키와 ⌥ (Option) 키를 한/영 전환으로 사용합니다.
en: Emulate Windows-style Han/Eng toggling. Use Right ⌘ (Command) and ⌥ (Option) keys for Han/Eng switching.
ja: Windowsスタイルの日/英(韓/英)切り替え動作をエミュレートします。 右⌘ (Command)キーと ⌥ (Option)キーを日/英(韓/英)切り替えとして使用します。
zh_hans: 模拟 Windows 风格的中/英切换行为。 使用右侧 ⌘ (Command) 键和 ⌥ (Option) 键进行中/英切换。

# session-settings.input.keyboard_hacks
source: 키보드 핵 (Hack) 설정
en: Keyboard Hack Settings
ja: キーボードハック (Hack) 設定
zh_hans: 键盘 Hack 设置

# session-settings.input.keyboard_hacks_desc
source: 사용자 편의를 위해 키보드 동작을 수정하거나 보완하도록 서버에 요청합니다. - 모든 서버가 이 Hack들을 지원하는 것은 아닙니다. - 일부 Hack은 상호 배타적입니다. 동시 사용 시 예기치 않은 동작이 발생할 수 있습니다.
en: Request the server to modify or augment keyboard behavior for user convenience. - Not all servers support these hacks. - Some hacks are mutually exclusive. Unexpected behavior may occur if used simultaneously.
ja: ユーザーの利便性のためにキーボード動作を修正したり補完するようサーバーに要求します。 - すべてのサーバーがこのHackをサポートしているわけではありません。 - 一部のHackは相互排他的です。同時使用時に予期しない動作が発生する可能性があります。
zh_hans: 请求服务器修改或补充键盘行为以方便用户。 - 并非所有服务器都支持这些 Hack。 - 部分 Hack 互斥。同时使用可能会导致意外行为。

# session-settings.projection.audio
source: 오디오 설정
en: Audio Settings
ja: オーディオ設定
zh_hans: 音频设置

# session-settings.projection.audio_codec_list.add.description
source: 추가할 코덱 유형을 선택하세요.
en: Select the codec type to add.
ja: 追加するコーデックの種類を選択してください。
zh_hans: 请选择要添加的编解码器类型。

# session-settings.projection.audio_codec_list.add.title
source: 코덱 선택
en: Select Codec
ja: コーデック選択
zh_hans: 选择编解码器

# session-settings.projection.audio_codec_list.description
source: 사용할 오디오 코덱의 우선순위를 설정합니다. 우선순위가 높은 코덱부터 서버와 협상을 시도합니다.
en: Set priority of audio codecs. Codecs with higher priority are attempted first during negotiation.
ja: 使用するオーディオコーデックの優先順位を設定します。優先順位が高いコーデックからサーバーとネゴシエーションを試みます。
zh_hans: 设置要使用的音频编解码器的优先级。将按照优先级从高到低的顺序尝试与服务器协商。

# session-settings.projection.audio_codec_list.empty
source: (구성된 코덱이 없습니다) 추가 버튼을 눌러 코덱을 등록하세요.
en: (No codecs configured) Click the Add button to register codecs.
ja: (構成されたコーデックがありません) 追加ボタンを押してコーデックを登録してください。
zh_hans: (没有配置编解码器) 请点击添加按钮注册编解码器。

# session-settings.projection.audio_codec_list.no_options
source: 이 코덱에는 설정할 수 있는 옵션이 없습니다.
en: There are no configurable options for this codec.
ja: このコーデックには設定できるオプションがありません。
zh_hans: 此编解码器没有可设置的选项。

# session-settings.projection.audio_codec_list.template.opus.description
source: 높은 음질과 낮은 지연 시간을 제공하는 현대적인 오디오 코덱입니다.
en: A modern audio codec providing high quality and low latency.
ja: 高音質と低遅延を提供するモダンなオーディオコーデックです。
zh_hans: 提供高音质和低延迟的现代音频编解码器。

# session-settings.projection.audio_codec_list.template.pcma.description
source: 유럽 등지에서 주로 사용되는 G.711 변형입니다.
en: A G.711 variant mainly used in Europe and other regions.
ja: ヨーロッパなどで主に使用されるG.711バリアントです。
zh_hans: 主要在欧洲等地使用的 G.711 变体。

# session-settings.projection.audio_codec_list.template.pcmu.description
source: 전통적인 전화망에서 사용되는 표준 코덱입니다. 호환성이 높습니다.
en: A standard codec used in traditional telephone networks. High compatibility.
ja: 従来の電話網で使用される標準コーデックです。互換性が高いです。
zh_hans: 传统电话网络中使用的标准编解码器。兼容性高。

# session-settings.projection.audio_codec_list.title
source: 오디오 코덱 우선순위 설정
en: Audio Codec Priority
ja: オーディオコーデック優先順位設定
zh_hans: 音频编解码器优先级设置

# session-settings.projection.audio.enable
source: 오디오 프로젝션 활성화
en: Enable Audio Projection
ja: オーディオプロジェクション有効化
zh_hans: 启用音频投影

# session-settings.projection.codec_list.add.description
source: 추가할 코덱 유형을 선택하세요.
en: Select the codec type to add.
ja: 追加するコーデックの種類を選択してください。
zh_hans: 请选择要添加的编解码器类型。

# session-settings.projection.codec_list.add.title
source: 코덱 선택
en: Select Codec
ja: コーデック選択
zh_hans: 选择编解码器

# session-settings.projection.codec_list.description
source: 서버에서 사용할 코덱의 우선순위를 설정합니다. 클라이언트와의 협상 시, 우선순위가 높은 코덱부터 시도합니다.
en: Set the priority of codecs to be used by the server. During negotiation with the client, codecs with higher priority are attempted first.
ja: サーバーで使用するコーデックの優先順位を設定します。クライアントとのネゴシエーション時、優先順位が高いコーデックから試行します。
zh_hans: 设置服务器要使用的编解码器的优先级。与客户端协商时，会从高优先级编解码器开始尝试。

# session-settings.projection.codec_list.empty
source: (구성된 코덱이 없습니다) 추가 버튼을 눌러 코덱을 등록하세요.
en: (No codecs configured) Click the Add button to register codecs.
ja: (構成されたコーデックがありません) 追加ボタンを押してコーデックを登録してください。
zh_hans: (没有配置编解码器) 请点击添加按钮注册编解码器。

# session-settings.projection.codec_list.template.h264.description
source: 가장 널리 사용되는 비디오 코덱입니다. 높은 호환성을 제공합니다.
en: The most widely used video codec. Provides high compatibility.
ja: 最も広く使用されているビデオコーデックです。高い互換性を提供します。
zh_hans: 最广泛使用的视频编解码器。提供高兼容性。

# session-settings.projection.codec_list.template.hevc.description
source: H.264보다 더 높은 압축 효율을 제공하는 최신 비디오 코덱입니다.
en: A modern video codec providing higher compression efficiency than H.264.
ja: H.264より高い圧縮効率を提供する最新のビデオコーデックです。
zh_hans: 提供比 H.264 更高压缩效率的最新视频编解码器。

# session-settings.projection.codec_list.template.mjpg.description
source: 전통적인 원격 데스크톱 환경에서 사용되는 비디오 코덱입니다. 가상 머신 환경에서 화면 변경이 잦은 컨텐츠를 표시해야 하는 경우 적합합니다.
en: A video codec used in traditional remote desktop environments. Suitable for displaying frequently changing content in virtual machine environments.
ja: 従来の遠隔デスクトップ環境で使用されるビデオコーデックです。 仮想マシン環境で画面変更が頻繁なコンテンツを表示する必要がある場合に適しています。
zh_hans: 用于传统远程桌面环境的视频编解码器。 适合在虚拟机环境下显示画面变化频繁的内容。

# session-settings.projection.codec_list.template.webp.description
source: 타일링된 WebP를 사용합니다. MJPG보다 압축 효율이 좋지만 리소스를 더 많이 사용합니다. 가상 머신 환경에서 화면 변경이 잦은 컨텐츠를 표시해야 하는 경우 적합합니다.
en: Use tiled WebP. Better compression than MJPG but uses more resources. Suitable for displaying frequently changing content in virtual machine environments.
ja: タイリングされたWebPを使用します。 MJPGより圧縮効率が良いですがリソースをより多く使用します。 仮想マシン環境で画面変更が頻繁なコンテンツを表示する必要がある場合に適しています。
zh_hans: 使用平铺 WebP。 压缩效率比 MJPG 好，但消耗更多资源。 适合在虚拟机环境下显示画面变化频繁的内容。

# session-settings.projection.codec_list.template.zrle.description
source: 전통적인 원격 데스크톱 환경에서 사용되는 비트맵 기반 비디오 코덱입니다. 가상 머신 환경에서 화면 변경이 적은 텍스트 위주의 컨텐츠를 표시해야 하는 경우 적합합니다.
en: A bitmap-based video codec used in traditional remote desktop environments. Suitable for displaying text-heavy content with few screen changes in virtual machine environments.
ja: 従来の遠隔デスクトップ環境で使用されるビットマップベースのビデオコーデックです。 仮想マシン環境で画面変更が少ないテキスト中心のコンテンツを表示する必要がある場合に適しています。
zh_hans: 用于传统远程桌面环境的基于位图的视频编解码器。 适合在虚拟机环境下显示画面变化较少的文本内容。

# session-settings.projection.codec_list.title
source: 코덱 우선순위 설정
en: Codec Priority
ja: コーデック優先順位設定
zh_hans: 编解码器优先级设置

# session-settings.projection.codec_mode
source: 코덱 설정 모드
en: Codec Setup Mode
ja: コーデック設定モード
zh_hans: 编解码器设置模式

# session-settings.projection.codec_mode_desc
source: 코덱 설정 모드를 선택합니다.
en: Select codec setup mode.
ja: コーデック設定モードを選択します。
zh_hans: 选择编解码器设置模式。

# session-settings.projection.codec_mode.manual
source: 직접 설정 (고급)
en: Manual (Advanced)
ja: 直接設定 (詳細)
zh_hans: 手动设置 (高级)

# session-settings.projection.codec_mode.manual_desc
source: 사용자가 직접 코덱 요구사항을 설정합니다.
en: Manually configure codec requirements.
ja: ユーザーが直接コーデック要求事項を設定します。
zh_hans: 用户直接设置编解码器要求。

# session-settings.projection.codec_mode.recommended
source: 권장 설정 사용 **(권장)**
en: Use Recommended Settings **(Recommended)**
ja: 推奨設定を使用 **(推奨)**
zh_hans: 使用推荐设置 **(推荐)**

# session-settings.projection.codec_mode.recommended_desc
source: Noctiluca Navigator에서 미리 정의된 코덱 설정을 사용합니다.
en: Use codec settings predefined by Noctiluca Navigator.
ja: Noctiluca Navigatorで事前に定義されたコーデック設定を使用します。
zh_hans: 使用 Noctiluca Navigator 中预定义的编解码器设置。

# session-settings.projection.codec_settings
source: 코덱 설정
en: Codec Settings
ja: コーデック設定
zh_hans: 编解码器设置

# session-settings.projection.codec.auto.description
source: 서버가 네트워크 환경과 클라이언트 측의 컴퓨팅 속도에 맞춰 자동으로 화면 품질을 결정합니다.
en: The server automatically determines screen quality based on the network environment and client-side computing speed.
ja: サーバーがネットワーク環境とクライアント側のコンピューティング速度に合わせて自動的に画質を決定します。
zh_hans: 服务器会根据网络环境和客户端的计算速度自动决定画面质量。

# session-settings.projection.codec.color_format
source: 색상 포맷
en: Color Format
ja: カラーフォーマット
zh_hans: 色彩格式

# session-settings.projection.codec.color_format.auto_desc
source: 최적의 색상 포맷을 자동으로 선택합니다.
en: Automatically select optimal color format.
ja: 最適なカラーフォーマットを自動的に選択します。
zh_hans: 自动选择最佳的色彩格式。

# session-settings.projection.codec.color_format.default_desc
source: 색상 포맷을 설정합니다.
en: Set color format.
ja: カラーフォーマットを設定します。
zh_hans: 设置色彩格式。

# session-settings.projection.codec.color_format.yuv420_desc
source: YUV 4:2:0 색상 포맷을 사용합니다. 대부분의 기기에서 호환됩니다.
en: Use YUV 4:2:0 color format. Compatible with most devices.
ja: YUV 4:2:0 カラーフォーマットを使用します。ほとんどのデバイスで互換性があります。
zh_hans: 使用 YUV 4:2:0 色彩格式。兼容大多数设备。

# session-settings.projection.codec.color_format.yuv444_desc
source: YUV 4:4:4 색상 포맷을 사용합니다. 텍스트 가독성이 향상되지만, 대역폭 사용량이 늘어나고 호환성이 떨어질 수 있습니다.
en: Use YUV 4:4:4 color format. Improves text readability but increases bandwidth usage and may reduce compatibility.
ja: YUV 4:4:4 カラーフォーマットを使用します。 テキストの可読性は向上しますが、帯域幅の使用量が増え、互換性が低下する可能性があります。
zh_hans: 使用 YUV 4:4:4 色彩格式。 文本可读性提高，但带宽使用量增加，兼容性可能会降低。

# session-settings.projection.codec.color_range
source: 색상 범위
en: Color Range
ja: 色範囲
zh_hans: 色彩范围

# session-settings.projection.codec.color_range.default_desc
source: 색상 범위를 설정합니다.
en: Set color range.
ja: 色範囲を設定します。
zh_hans: 设置色彩范围。

# session-settings.projection.codec.color_range.full
source: 전체
en: Full
ja: フル
zh_hans: 全范围 (Full)

# session-settings.projection.codec.color_range.full_desc_format
source: 전체 색상 범위 %@를 사용합니다. 색상 재현이 더 좋지만, 일부 기기에서 호환성 문제가 발생할 수 있습니다.
en: Use full color range %@. Color reproduction is better, but compatibility issues may occur on some devices.
ja: 全色域 %@ を使用します。 色の再現性は向上しますが、一部のデバイスで互換性の問題が発生する可能性があります。
zh_hans: 使用全色阶范围 %@。 色彩还原度更好，但可能会在部分设备上出现兼容性问题。
